
var bitakSahebList = [
    {
        id: 0,
        date: { day: "14", month: "July", year: "2025" },
        title: "श्री प्राणनाथ जी वाणी ज़ूम (प्रेम मंदिर) में पूज्य स्वामी जी के पधारने पर सभी सुंदरसाथ जी में उत्साह की लहर",
        speaker: "श्री राजन स्वामी जी",
        time: "6:00-7:30 am",
        description: "पुलकित हृदयों से श्री बीतक साहेब 2025 के लिए रखे गए 2 पाठों के समाप्ति पूजन (14 जुलाई) पर श्री प्राणनाथ जी वाणी ज़ूम (प्रेम मंदिर) में पूज्य स्वामी जी के पधारने पर सभी सुंदरसाथ जी में उत्साह की लहर",
        image: "/assets/img/bitaksaheb/14_day_2.jpg",
        link: "https://youtu.be/lyT301B2Nng?si=Zv0TbuaecCgzmz2x",
        bitakSandesh: {
            text: "️पूज्य स्वामी जी के पधारने पर सभी सुंदरसाथ जी में उत्साह की लहर",
            image: "/assets/img/bitaksaheb/14_day_1.jpg",
        },
        quote: {
            text: "ध्यान, वाणी मन्थन और सेवा ही सुन्दरसाथ की आत्मिक सम्पति है।",
            author: "श्री राजन स्वामी जी"
        },
        qa: {
            question: "",
            answer: "",
            link: ""
        },
        game: {
            title: "",
            description: "",
            link: ""
        },
        reel: {
            youtube_embed: "MajSGbv7iic",
            facebook_embed: "",
            title: " स्वामी जी की ओर से सभी प्यारे सुंदरसाथ जी को प्रेम भरा निमंत्रण",
            subtext: "श्री प्राणनाथ ज्ञानपीठ के 19वें वार्षिकोत्सव के लिए स्वामी जी की ओर से सभी प्यारे सुंदरसाथ जी को प्रेम भरा निमंत्रण एवं श्री बीतक साहेब चर्चा के प्रथम प्रयास के लिए पूज्य स्वामी जी का आशीर्वाद व शुभकामनाएँ"
        }
    },
    {
        id: 1,
        date: { day: "15", month: "July", year: "2025" },
        title: "अथ तीन सरूपों की बीतक",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "अथ तीन सरूपों की बीतक — जीव, माया और ब्रह्म का गूढ़ ज्ञान, श्रद्धा और भक्ति से ओतप्रोत पहली दिन की अद्भुत शुरुआत।",
        image: "/assets/img/bitaksaheb/bitaksaheb_day1.png",
        link: "https://youtu.be/P2S20KesJhI?si=3p9J2L4A5WCRe0HB",
        bitakSandesh: {
            text: "️सुनो नहीं, जी लो श्री बीतक साहेब का हर पल",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day1.jpeg",
        },
        quote: {
            text: "ध्यान से भीतर उतरने वाला ही आत्मा की शांति और ब्रह्म का साक्षात्कार कर सकता है।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 1",
            link: "https://forms.gle/QGYee9gWsSMJTdHb7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95007/777/595"
        },
        reel: {
            youtube_embed: "Zv3tysn1Y4U",
            facebook_embed: "",
            title: "#1 बीतक - माया के तूफानों के बीच श्रीजी के लाड ",
            subtext: ""
        }
    },
    {
        id: 2,
        date: { day: "16", month: "July", year: "2025" },
        title: "आखिर क्यों रचा गया ब्रज और रास का खेल?",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "🌹 Day 2 || सोनिया जी (ऑस्ट्रेलिया) द्वारा श्री बीतक चर्चा 2025 || Live Streaming- 16 July 🌹",
        image: "/assets/img/bitaksaheb/bitaksaheb_day2.png",
        link: "https://www.youtube.com/live/8RYneqG7DzU?si=rmCbftf0svEZTvfP",
        bitakSandesh: {
            text: "️💎 श्री बीतक संदेश - 2, सुनो नहीं, जी लो — बीतक साहेब का हर पल 💎",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day2.jpeg",
        },
        quote: {
            text: "आपण ने तेडवा आविया, आ दुस्तर माया मांहें। <br> ओलखी ने कां ओसरे, भूंडा एम थयो तू कांए।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 2",
            link: "https://forms.gle/1MkmAZTecGGZbSES7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/94897/664/664"
        },
        reel: {
            youtube_embed: "MeWPaxUsP9Q",
            facebook_embed: "",
            title: "#2 बीतक - महारास की रामतों में जागनी रास के संकेत",
            subtext: ""
        }
    },
    {
        id: 3,
        date: { day: "17", month: "July", year: "2025" },
        title: "प्रियतम की खोज में तप और त्याग की मूरत – श्री देवचन्द्र जी",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "प्रियतम की खोज में तप और त्याग की मूरत",
        image: "/assets/img/bitaksaheb/bitaksaheb_day3.png",
        link: "https://youtu.be/34fkae_prYU?si=_28hDaNEGnRidxUJ",
        bitakSandesh: {
            text: "️💎 श्री बीतक संदेश - 3, बीतक में उतरें तो समझेंगे — धनी कितने पास हैं।",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day3.jpeg",
        },
        quote: {
            text: "जब जनमे मारवाड़ में, घर अति आनन्द नरनार। <br> यह बधाई ब्रह्मांड में, त्रिगुण समेत विस्तार।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 3",
            link: "https://forms.gle/WBJgdJFbhZPRn9Wu6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/94917/667/619"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1233624818089135",
            title: "#3 बीतक - माया रूपी गठरी सौंप कर तो देखिए साथ जी",
            subtext: ""
        }
    },
    {
        id: 4,
        date: { day: "18", month: "July", year: "2025" },
        title: "'सखी भाव से भजियो भरतार' - हरिदास जी की प्रेममयी सिखापन।",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "'सखी भाव से भजियो भरतार' - हरिदास जी की प्रेममयी सिखापन।",
        image: "/assets/img/bitaksaheb/bitaksaheb_day4.png",
        link: "https://youtu.be/6FEAlVEKlTo?si=EOQDKjoG8a8kUhxM",
        bitakSandesh: {
            text: "️💎 श्री बीतक संदेश - 4: सुनो नहीं, जी लो — बीतक साहेब का हर पल। 💎",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day4.jpeg",
        },
        quote: {
            text: "जब जनमे मारवाड़ में, घर अति आनन्द नरनार। <br> यह बधाई ब्रह्मांड में, त्रिगुण समेत विस्तार।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 4",
            link: "https://forms.gle/uJueEQaEau8Be1T58"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/94960/078/808"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1353370802428046",
            title: "#4 बीतक - हुकम के खेल में रहनी का श्रृंगार",
            subtext: ""
        }
    },
    {
        id: 5,
        date: { day: "19", month: "July", year: "2025" },
        title: "श्री देवचंद्र जी को धाम धनी के साक्षात दर्शन",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "'Day 5 - श्री बीतक साहेब - सोनिया सखी (ऑस्ट्रेलिया) - श्री देवचंद्र जी को धाम धनी के साक्षात दर्शन",
        image: "/assets/img/bitaksaheb/bitaksaheb_day5.png",
        link: "https://youtu.be/cF5Jh1lOslU?si=ZcN9gGArbDFTnFol",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 5: When Bītak flows, maya fades. Only Piya remains.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day5.jpeg",
        },
        quote: {
            text: "वय किसोर अति सुन्दर, सरूप खेला जो वृन्दावन। देख श्री देवचन्द्र जी ने कह्या, जैसी गवाही दई मन।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 5",
            link: "https://forms.gle/tqePda9EfoeY1kLm9"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/94982/979/711"
        },
        reel: {
            youtube_embed: "XN5LDz036OY",
            facebook_embed: "",
            title: "#5 बीतक - आत्मिक आहार की वैरायटी",
            subtext: ""
        }
    },
    {
        id: 6,
        date: { day: "20", month: "July", year: "2025" },
        title: "श्री मिहिरराज जी व सतगुरु देवचन्द्र जी का मिलन",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "🌸 Day 6 - श्री बीतक साहेब - सोनिया सखी (ऑस्ट्रेलिया) - मिहिरराज जी व सतगुरु देवचन्द्र जी का मिलन 🌸",
        image: "/assets/img/bitaksaheb/bitaksaheb_day6.png",
        link: "https://youtu.be/4Q-LE9mTAjI?si=G2-bLSOf4g2kLRUV",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 6: Feel the words, meet yourself.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day6.jpeg",
        },
        quote: {
            text: "मिलाप श्री देवचन्द्रजी का, सोहबत श्रीजी साहिब। <br> सम्वत सोलह सै सतासियमें, सो सत्रह सौ बारोत्तरलों अब।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 6",
            link: "https://forms.gle/aEasDBdNq9wDaJPDA"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95006/883/983"
        },
        reel: {
            youtube_embed: "_QTGlgqWVXM",
            facebook_embed: "",
            title: "#6 बीतक - विकारों को मायके भेज दीजिए ",
            subtext: ""
        }
    },
    {
        id: 7,
        date: { day: "21", month: "July", year: "2025" },
        title: "श्री सतगुरु और मिहिरराज जी में 9 वर्ष का कठिन वियोग",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "🌸 Day 7 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - सतगुरु और मिहिरराज जी में 9 वर्ष का कठिन वियोग",
        image: "/assets/img/bitaksaheb/bitaksaheb_day7.png",
        link: "https://youtu.be/dQZVntTml-w?si=NTyhSz5iFZ4kYhk-",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 7: बीतक में उतरें तो समझेंगे — धनी कितने पास हैं।",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day7.jpeg",
        },
        quote: {
            text: "तब बिहारीजी को कह्या, तुम बुलाये ल्याओ इन। <br> मैं धाम दरवाजे पैठ ना सकों, ठाढ़ी इन्द्रावती करे रुदन।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 7",
            link: "https://forms.gle/ZqKquYthM6EkPzug9"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/resource/95048614"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2024550624954923",
            title: "#7 बीतक - ‘दिल’ से माया को हटाओ, ‘पिया’ को बसाओ",
            subtext: ""
        }
    },
    {
        id: 8,
        date: { day: "22", month: "July", year: "2025" },
        title: " हब्से में मार्मिक विरह और तारतम वाणी अवतरण",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 8 - श्री बीतक साहेब - सोनिया सखी (ऑस्ट्रेलिया) - हब्से में मार्मिक विरह और तारतम वाणी अवतरण",
        image: "/assets/img/bitaksaheb/bitaksaheb_day8.png",
        link: "https://youtu.be/b2lrZhaw-UY?si=rgS5q8LM6RBEvwUG",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 8: Every word whispers: I'm with you. 💞 – श्रीजी",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day8.jpeg",
        },
        quote: {
            text: "मिलाप श्री देवचन्द्रजी का, सोहबत श्रीजी साहिब। <br> सम्वत सोलह सै सतासियमें, सो सत्रह सौ बारोत्तरलों अब।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 8",
            link: "https://forms.gle/7S2rPHXf7yPHjoPR9"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95085/549/838"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2201409173632457",
            title: "#8 बीतक - नैनन की करि कोठरी में प्रेम ही प्रेम",
            subtext: ""
        }
    },
    {
        id: 9,
        date: { day: "23", month: "July", year: "2025" },
        title: "श्री जी की हरजी व्यास से भेंट और वार्ता",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 9 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्री जी की हरजी व्यास से भेंट और वार्ता",
        image: "/assets/img/bitaksaheb/bitaksaheb_day9.png",
        link: "https://youtu.be/0B9y3HTd8VY?si=6iR-hHS6a48Ml8cH",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 9 Read slowly… it's not text, it's truth.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day9.jpeg",
        },
        quote: {
            text: "तब श्री जी ए कह्या, ए तो कह्या मिने इण्ड। <br> ए महाप्रलय में ना रहे, उड़े त्रिगुन समेत ब्रह्माण्ड।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 9",
            link: "https://forms.gle/JNDuXLfYC619EoZ7A"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/resource/95151370"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2134820150372021",
            title: "#9 बीतक - झुकने में जो ऊँचाई है, वो बीतक में दिखलाई है",
            subtext: ""
        }
    },
    {
        id: 10,
        date: { day: "24", month: "July", year: "2025" },
        title: "ईमान की कसौटी पर खरे उतरे जयराम भाई कंसारा",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 10 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - ईमान की कसौटी पर खरे उतरे जयराम भाई कंसारा",
        image: "/assets/img/bitaksaheb/bitaksaheb_day10.png",
        link: "https://youtu.be/TTh8N-h6VZw?si=bAkf4w-HM3LqT6jp",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 10 This is not content. It’s contact with the divine.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day10.jpeg",
        },
        quote: {
            text: "एक जयराम खड़ा रह्या, और इनके घर के लोक। <br> इनों आपोपा दिया, रहे अपने जोक।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 10",
            link: "https://forms.gle/jeGvmh8DPNmXpMDy5"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95171/689/838"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1400972371122437",
            title: "#10 बीतक - द ब्रह्मांगना ब्रैंड - The Bramhangana Brand",
            subtext: ""
        }
    },
    {
        id: 11,
        date: { day: "25", month: "July", year: "2025" },
        title: "श्रीजी द्वारा ठट्ठानगर में जागनी",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 11 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्रीजी द्वारा ठट्ठानगर में जागनी",
        image: "/assets/img/bitaksaheb/bitaksaheb_day11.png",
        link: "https://youtu.be/pHGSqRJyfiU?si=T_Gm3GGajQeyg0P6",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 11 Not a story. A soul’s memory – echoed by Piya. ",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day11.jpeg",
        },
        quote: {
            text: "तब श्रीजीयें सराहिया, स्याबास चिन्तामन। <br> पाई तें निसबत, ए सुकन मोमिन।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 11",
            link: "https://forms.gle/ZuMMAypEaqvCv8Ti8"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95209/975/819"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2265430630578769",
            title: "#11 बीतक - Beetak is a MIRROR for HEART",
            subtext: ""
        }
    },
    {
        id: 12,
        date: { day: "26", month: "July", year: "2025" },
        title: "श्रीजी की आज्ञा मान कर भैरव सेठ ने तीन दिन में वस्त को किया प्राप्त",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 12 - श्री बीतक साहेब - श्रीजी की आज्ञा मान कर भैरव सेठ ने तीन दिन में वस्त को किया प्राप्त",
        image: "/assets/img/bitaksaheb/bitaksaheb_day12.png",
        link: "https://youtu.be/-dRh4o-2Ly0?si=muycVNp8KFvs7VuB",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 12 Every line = One step closer to Him.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day12.jpeg",
        },
        quote: {
            text: "पीउना तमाखूं छोड़ देओ, और मांस मछली सब। <br> सराब और सब कैफ, परदारा चोरी न कब।।<br> <br> मैं जनम भर को छोड़िया, ए चारों वस्त निखेद। <br> वस्त भई मोहे प्रापत, पाया माया माहें भेद।। <br> ",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 12",
            link: "https://forms.gle/xLk1UjCRZbmAchbb6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/resource/95241481"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1806151253645136",
            title: "#12 बीतक - मिश्री की ईंटों से बनता प्रेम का मकान",
            subtext: ""
        }
    },
    {
        id: 13,
        date: { day: "27", month: "July", year: "2025" },
        title: "श्रीजी की करुणा और बिहारीजी की मर्यादा में टकराव, धाराभाई का निष्कासन",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 13 - श्री बीतक साहेब - श्रीजी की करुणा और बिहारीजी की मर्यादा में टकराव, धाराभाई का निष्कासन",
        image: "/assets/img/bitaksaheb/bitaksaheb_day13.png",
        link: "https://youtu.be/QlTpOxOd23E?si=3a-nQtWzR6zmKo6d",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 13 Dive deeper. Truth isn't on the surface.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day13.jpeg",
        },
        quote: {
            text: "बहुत खीझ के कह्या, इनें करों न दाखिल साथ। <br> इनका दुख मोहे बहुत है, याके कबहुं न पकड़ो हाथ।।<br> <br> तब श्री जी साहिब जी नें, दिन दोय चार बीच डार। <br> फेर अरज विनती करी, तुम इनका करो विचार।। <br> ",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 13",
            link: "https://forms.gle/s6j5jTfWqh5bqPqi7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95255/642/796"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "4610386935854218",
            title: "#13 बीतक - पाँचवें दिन के सुंदरसाथ - 30 दिनों का लक्ष्य 3 दिन में प्राप्त, छठे दिन के सुंदरसाथ - आपस के विवादों में ऊर्जा समाप्त",
            subtext: ""
        }
    },
    {
        id: 14,
        date: { day: "28", month: "July", year: "2025" },
        title: "श्री जी और बिहारी जी के सिद्धांतों में अंतर",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 14 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्री जी और बिहारी जी के सिद्धांतों में अंतर",
        image: "/assets/img/bitaksaheb/bitaksaheb_day14.png",
        link: "https://youtu.be/ME4nqRzEvYA?si=AD9yZq7100cFlOeK",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 14 You don't just read Bitak. You return to yourself.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day14.jpeg",
        },
        quote: {
            text: "तब श्री जी साहिब जी नें, दिन दोय चार बीच डार। <br> फेर अरज विनती करी, तुम इनका करो विचार।। ",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 14",
            link: "https://forms.gle/RCwwbeDR3TqN19sa6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95292/216/337"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "732199306268115",
            title: "#14 बीतक - बीतक - आकर्षण पानी का बुलबुला न हो",
            subtext: ""
        }
    },
    {
        id: 15,
        date: { day: "29", month: "July", year: "2025" },
        title: "श्री जी और बिहारी जी के मार्ग हुए विमुख",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 15 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्री जी और बिहारी जी के मार्ग हुए विमुख",
        image: "/assets/img/bitaksaheb/bitaksaheb_day15.png",
        link: "https://youtu.be/kyxhAIOSem8?si=agamf5FPgpXlQwUi",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 15 Truth isn’t taught. It’s felt through Bitak.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day15.jpeg",
        },
        quote: {
            text: "तब श्री जी साहिब जी नें, दिन दोय चार बीच डार। <br> फेर अरज विनती करी, तुम इनका करो विचार।। ",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 15",
            link: "https://forms.gle/BPQ8yR4EVxpvBe9w6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/resource/95336574"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2516556442052342",
            title: "#15 बीतक - बीतक - ये सेवा नहीं आसां...",
            subtext: ""
        }
    },
    {
        id: 16,
        date: { day: "30", month: "July", year: "2025" },
        title: "सिद्धपुर में पहला ज्ञानकेंद्र, मेड़ता में राजा राम + झांझन भाई की सेवा",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 16 - श्री बीतक साहेब - सिद्धपुर में पहले ज्ञानकेंद्र की स्थापना, मेड़ता में राजा राम जी एवं झांझन भाई जी की अविस्मरणीय सेवा प्रारंभ।",
        image: "/assets/img/bitaksaheb/bitaksaheb_day16.png",
        link: "https://youtu.be/-ebFQ73yPNk?si=CsuQZ_Dgns8h8r-n",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 16 One verse. Infinite peace. 🌿 That’s the power of Bitak.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day16.jpeg",
        },
        quote: {
            text: "थाना थाप्या सिद्धपुर में, केसव भट्ट के घर। <br> धाम चरचा नित होवहीं, साथ रह्या पकर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 16",
            link: "https://forms.gle/Pe7jvGkdrTdE6ZQu7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95381/732/799"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1091818085683250",
            title: "#16 बीतक - पिया के हृदय 💖 का रास्ता नाप लें",
            subtext: ""
        }
    },
    {
        id: 17,
        date: { day: "31", month: "July", year: "2025" },
        title: "श्रीजी का दिल्ली आगमन, हरिद्वार की ओर कूच",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 17 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्रीजी का दिल्ली आगमन, हरिद्वार की ओर कूच",
        image: "/assets/img/bitaksaheb/bitaksaheb_day17.png",
        link: "https://youtu.be/LJJpjooDI8o?si=yg1Q5_1s4AM-oNY6",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 17 This is not content. It’s contact with the divine",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day17.jpeg",
        },
        quote: {
            text: "इन पाती लिखने में रहें, श्री जी और लालदास। <br> रात दिन मेहनत करी, श्री राज सेवन की आस।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 17",
            link: "https://forms.gle/A9unNG8BN6bFBDEx6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95422/431/977"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1686576212002409",
            title: "#17 बीतक - आंतरिक सौंदर्य+सेवा=ललिता सखी",
            subtext: ""
        }
    },
    {
        id: 18,
        date: { day: "1", month: "August", year: "2025" },
        title: "श्रीजी का हरिद्वार में शास्त्रार्थ प्रारम्भ",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 18 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - हरिद्वार में शास्त्रार्थ प्रारम्भ ",
        image: "/assets/img/bitaksaheb/bitaksaheb_day18.png",
        link: "https://youtu.be/bONOmf2I0jU?si=scYXQAUeWLnwiTxw",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 18 Where logic ends, Bitak begins. 💖 It speaks the language of love.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day18.jpeg",
        },
        quote: {
            text: "तब कहे बचन श्री राज नें, तुम प्राचीन पुरातम। <br> सो कहो हमें समझाय कें, अपनो इष्ट जो धरम।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 18",
            link: "https://forms.gle/ygnds2LGKiEzixk48"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95459/745/866"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1503055707372439",
            title: "#18 बीतक - ज्ञान+प्रेम का अमृत मंथन",
            subtext: ""
        }
    },
    {
        id: 19,
        date: { day: "2", month: "August", year: "2025" },
        title: "श्रीजी का 6 दर्शन के आचार्यों के साथ शास्त्रार्थ",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 19 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - 6 दर्शन के आचार्यों के साथ शास्त्रार्थ",
        image: "/assets/img/bitaksaheb/bitaksaheb_day19.png",
        link: "https://youtu.be/IWyIkvo6dSU?si=0IDYfmXMU12Ke4EM",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 19 Every verse = a door, Shriji opens it... when the heart is ready",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day19.jpeg",
        },
        quote: {
            text: "हरद्वार के मेला में, चार सम्प्रदाय ताहिं। <br> षट दर्शन भी तहां मिले, दस नाम संन्यासी जाहिं।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 19",
            link: "https://forms.gle/ENVUCVuoAKagkTLg6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95485/561/628"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "788560647163577",
            title: "#19 बीतक - मोहे कहीं और नहीं देखना",
            subtext: ""
        }
    },
    {
        id: 20,
        date: { day: "3", month: "August", year: "2025" },
        title: "श्री विजयाभिनंदन बुद्ध निष्कलंक स्वरूप",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 20 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - 'श्री विजयाभिनंदन बुद्ध निष्कलंक स्वरूप'",
        image: "/assets/img/bitaksaheb/bitaksaheb_day20.png",
        link: "https://youtu.be/5jlbyFdsT6Q?si=DybuxQRcSYuVhNZt",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 20 Let the world scroll… You stay with Bitak",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day20.jpeg",
        },
        quote: {
            text: "दिव्य ब्रह्मपुर धाम है, घर अक्षरातीत निवास। <br> निजानन्द है सम्प्रदा, ए उत्तर प्रस्न प्रकास।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 20",
            link: "https://forms.gle/nkRHYMt8DytZBnDK8"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95485/561/628"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1262130558651688",
            title: " #20 बीतक - पिया से पिया की मांग - यही अंतिम व्यापार ",
            subtext: ""
        }
    },
    {
        id: 21,
        date: { day: "4", month: "August", year: "2025" },
        title: " कयामत के निशानों का जाहिर होना",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 21 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - कयामत के निशानों का जाहिर होना",
        image: "/assets/img/bitaksaheb/bitaksaheb_day21.png",
        link: "https://youtu.be/E-DV8HcyQHI?si=FbG0Gi5DG2z0spSc",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 21 Bitak isn't read. It's received. Heart to heart 💕 Soul to soul.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day21.jpeg",
        },
        quote: {
            text: "महामत कहे सुनो साथ जी, जो तुम में बीतक। <br> लिखी लोमोफूज में, तुम्हारे ताले हक।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 21",
            link: "https://forms.gle/9Jq8zm2iNBwe3JSe7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95547/584/112"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1475262087245588",
            title: "#21 बीतक - सृष्टि की शुरुआत सतयुग से ही क्यों?",
            subtext: ""
        }
    },
    {
        id: 22,
        date: { day: "5", month: "August", year: "2025" },
        title: " कयामत के निशानों का जाहिर होना",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 22 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - कयामत के निशानों का जाहिर होना",
        image: "/assets/img/bitaksaheb/bitaksaheb_day22.png",
        link: "https://youtu.be/E-DV8HcyQHI?si=FbG0Gi5DG2z0spSc",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 22 Bitak isn't read with eyes... It's absorbed through PREM ",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day22.jpeg",
        },
        quote: {
            text: "मोमिन तो हैं गरीब, बकरी जेता बल। <br> पढ़े बाघ ज्यों बोलहीं, ए सीधे निरमल।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 22",
            link: "https://forms.gle/VtzS3jRCP4S9uETS7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95598/819/608"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1473564904092406",
            title: "#22 बिरहा की जो आँच लगै मन में",
            subtext: ""
        }
    },
    {
        id: 23,
        date: { day: "6", month: "August", year: "2025" },
        title: "मोमिनों ने श्रीजी से किया मिलाप",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 23 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - मोमिनों ने श्रीजी से किया मिलाप",
        image: "/assets/img/bitaksaheb/bitaksaheb_day23.png",
        link: "https://youtu.be/ILqW2UHwQzE?si=t2DldfD3iPnJEVOc",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 23 Bitak reveals memories of Brij 🦚 Raas and Jagni",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day23.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 23",
            link: "https://forms.gle/nh3oxs4x9QQvsr2K6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95644/966/570"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "24705850182354496",
            title: "#23 बीतक - प्रेम पाती का रंग चढ़ाय दियो रे",
            subtext: ""
        }
    },
    {
        id: 24,
        date: { day: "7", month: "August", year: "2025" },
        title: "श्रीजी ने फकीरी वेश धारण कर सुंदरसाथ को एकरस किया",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 24-श्री बीतक साहेब-सोनिया जी (ऑस्ट्रेलिया)- श्रीजी ने फकीरी वेश धारण कर सुंदरसाथ को एकरस किया",
        image: "/assets/img/bitaksaheb/bitaksaheb_day24.png",
        link: "https://youtu.be/6pH7Ln2dMjU?si=oT9KeuRqan39HjZY",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 24 Bitak reveals memories of Brij 🦚 Raas and Jagni",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day24.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 24",
            link: "https://forms.gle/X6A7TYM8sUJtnx2w7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95690/348/781"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "774562845072215",
            title: "#24 बीतक - मैं घटे तो तू जुड़े",
            subtext: ""
        }
    },
    {
        id: 25,
        date: { day: "8", month: "August", year: "2025" },
        title: "राजा भावसिंह की जागृति, आकोट में शुक्राना",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 25 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - राजा भावसिंह की जागृति, आकोट में शुक्राना",
        image: "/assets/img/bitaksaheb/bitaksaheb_day25.png",
        link: "https://youtu.be/kJ8gGl7tgDI?si=f7GEmbgibhlZ0wRY",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 25 Bitak reveals memories of Brij 🦚 Raas and Jagni",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day25.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 25",
            link: "https://forms.gle/UqMFt7kurvxLsquh7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95729/396/514"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "632545179440439",
            title: "#25 बीतक - जागनी सेवा की पहेली",
            subtext: ""
        }
    },
    {
        id: 26,
        date: { day: "9", month: "August", year: "2025" },
        title: "श्रीजी और महाराजा छत्रसाल जी का मधुर मिलाप",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 26 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्रीजी और महाराजा छत्रसाल जी का मधुर मिलाप",
        image: "/assets/img/bitaksaheb/bitaksaheb_day26.png",
        link: "https://youtu.be/_YwBwaL4EAc?si=GYnoQmmFbhi58y6u",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 26 Bitak isn't read with eyes. It's absorbed through heart ",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day26.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 26",
            link: "https://forms.gle/LtCD4SchAzgC8wjJ7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95763/072/560"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1968789793893447",
            title: "#26 बीतक - मुझे है कदमों की आस ",
            subtext: ""
        }
    },
    {
        id: 27,
        date: { day: "10", month: "August", year: "2025" },
        title: "श्रीजी की मेहर से छत्रसाल जी बने महाराजा",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 27 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्रीजी की मेहर से छत्रसाल जी बने महाराजा",
        image: "/assets/img/bitaksaheb/bitaksaheb_day27.png",
        link: "https://youtu.be/DsJoSuNGJVc?si=ZPon0oyhuXhm9SOu",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 27 Every Chaupai is a step closer to Him",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day27.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 27",
            link: "https://forms.gle/Mizt3zxo77GF37Et7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95773/789/702"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "31650269307951088",
            title: "#27 बीतक - ये सौदा है प्रेम का",
            subtext: ""
        }
    },
    {
        id: 28,
        date: { day: "11", month: "August", year: "2025" },
        title: "श्री पद्मावती पुरी धाम की महिमा एवं शुक्राना",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 28 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्री पद्मावती पुरी धाम की महिमा एवं शुक्राना",
        image: "/assets/img/bitaksaheb/bitaksaheb_day28.png",
        link: "https://youtu.be/FWAX0vL_oe8?si=fy2QuioORCcr0X7F",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 28 Bitak’s words are seeds. They bloom in the soul. 🌸🌱",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day28.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 28",
            link: "https://forms.gle/PFy355z8kMksJkAAA"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95815/475/671"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "765250236051972",
            title: "#28 बीतक - प्रेम की ऊँची उड़ान ",
            subtext: ""
        }
    },
    {
        id: 29,
        date: { day: "12", month: "August", year: "2025" },
        title: "प्रथम प्रहर की सेवा ",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 29 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - प्रथम प्रहर की सेवा ",
        image: "/assets/img/bitaksaheb/bitaksaheb_day29.png",
        link: "https://youtu.be/Q4u38ZbJ1Zk?si=fUhDmLGs0FS9slwO",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 29 Bitak doesn’t need your mind. It asks for your heart 💖",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day29.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 29",
            link: "https://forms.gle/wxkMEoUnVv2C6MyB8"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95868/748/591"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1115881407081227",
            title: "#29 बीतक - प्रेम रसायन कौन पीवै",
            subtext: ""
        }
    },
    {
        id: 30,
        date: { day: "13", month: "August", year: "2025" },
        title: "अष्ट प्रहर पन्ना जी में सुंदरसाथ की प्रेम सेवा",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 30 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया)- अष्ट प्रहर पन्ना जी में सुंदरसाथ की प्रेम सेवा",
        image: "/assets/img/bitaksaheb/bitaksaheb_day30.png",
        link: "https://youtu.be/BD4Kav4bFkg?si=IkyhqmVbtjvPNKuz",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 30 Bitak is not read. It’s entered into Heart 💖",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day30.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 30",
            link: "https://forms.gle/cN42ZNtSZ7mwZAeCA"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95912/338/111"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "778384854871993",
            title: "#30 बीतक - मोहे सेवा प्यारी पिउ की ",
            subtext: ""
        }
    },
    {
        id: 31,
        date: { day: "14", month: "August", year: "2025" },
        title: "लाल दास जी द्वारा छत्तीस कारखानों की सेवा",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 31 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - लाल दास जी द्वारा छत्तीस कारखानों की सेवा",
        image: "/assets/img/bitaksaheb/bitaksaheb_day31.png",
        link: "https://youtu.be/nvlT5nXZeJs?si=lezLj-4lIqebCrCv",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 31 Not a book, A bridge to Piyaji. 🌉💞",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day31.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 31",
            link: "https://forms.gle/LfrYgL47MoT4i1jh9"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95970/359/900"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "1782701735698775",
            title: "#31 बीतक - इस खारी जिमी में निसबतियों ने धनी के पकड़े हाथ ",
            subtext: ""
        }
    },
    {
        id: 32,
        date: { day: "15", month: "August", year: "2025" },
        title: "सज गया जागनी ब्रह्माण्ड का मूल मिलावा",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 32 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - सज गया जागनी ब्रह्माण्ड का मूल मिलावा",
        image: "/assets/img/bitaksaheb/bitaksaheb_day32.png",
        link: "https://youtu.be/EZUFf6l5KcQ?si=PgrKVD3hLrEloysh",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 32 इस स्वतंत्रता दिवस, आइये सुंदरसाथ जी, बाहरी आज़ादी के साथ-साथ भीतर की स्वतंत्रता 💖 का भी उत्सव मनाएँ। 🇮🇳 वंदे मातरम् 🇮🇳",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day32.jpeg",
        },
        quote: {
            text: "मेरे प्रेम भीने श्री साथ जी, मेरे सांचे सूर धीर। <br> पांव भर दिखावत रूहों को, तुम बैठे हो हक के तीर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 32",
            link: "https://forms.gle/5b3qJELF6S8vZywG9"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95993/123/402"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2692424867755850 ",
            title: "#32 बीतक - प्यारे सतगुरु की मेहर ने संभव ने बना दिया",
            subtext: ""
        }
    }
]


function displaykarkhanaNames(divid, bitakSaheb) {
    const studentsList = document.getElementById(divid);

    for (let i = 0; i < bitakSaheb.length; i++) {
        studentsList.innerHTML =
            studentsList.innerHTML +
            `
            <li class="timeline-item">
                <div class="timeline-info">
                    <div class="date-box">
                        <div class="date-day">${bitakSaheb[i].date.day}</div>
                        <div class="date-month-year">
                            <span class="date-month">${bitakSaheb[i].date.month}</span>
                            <span class="date-year">${bitakSaheb[i].date.year}</span>
                        </div>
                    </div>
                </div>
                <div class="timeline-marker"></div>
                <div class="timeline-content">
                    <div class="container">
                        <div class="row bitak-card">
                            <div class="col-md-8">
                                <img src="${bitakSaheb[i].image}"
                                    alt="Event Image" class="bitak-card-image mb-4">
                                <div class="row">
                                    <div class="col-md-9">
                                        <a target="_blank" href="${bitakSaheb[i].link}" class="bitak-title"> ${bitakSaheb[i].title}
                                        </a>
                                        <h6 class="bitak-meta d-md-block"><i data-feather="user"
                                                class="mb-2"></i>${bitakSaheb[i].speaker} |

                                            <div class="event-date d-inline-block">
                                                <i data-feather="clock"></i>
                                            ${bitakSaheb[i].time}
                                            </div>
                                        </h6>
                                    </div>
                                    <div class="col-md-3">
                                        <a href="${bitakSaheb[i].link}" target="_blank"
                                                        class="btn btn-primary bitak-btn pulse-button" > लाइव देखें</a>
                                    </div>
                                </div>
                                <p class="bitak-text">
                                    ${bitakSaheb[i].description}
                                </p>
                                <div class="row">
                                    <div class="col-sm-6 ${bitakSaheb[i].qa && bitakSaheb[i].qa.link.trim() !== '' ? '' : 'd-none'}">
                                        <div class="qa-box">
                                            <i data-feather="help-circle" class="mb-2 "></i><br>
                                            <div class="question">${bitakSaheb[i].qa.question}  </div>
                                            <div class="answer">${bitakSaheb[i].qa.answer}</div>
                                            <a target="_blank" class="btn btn-primary pulse-btn-sm " href="${bitakSaheb[i].qa.link}">बीतक क्विज़</a> 
                                        </div>
                                    </div>
                                    <div class="col-sm-6 ${bitakSaheb[i].qa && bitakSaheb[i].game.link.trim() !== '' ? '' : 'd-none'}">
                                        <div class="game-card">
                                            <i data-feather="github" class="mb-2 "></i><br>
                                            <div class="game-title">${bitakSaheb[i].game.title}</div>
                                            <div class="game-desc">${bitakSaheb[i].game.description}</div>
                                            <a href="${bitakSaheb[i].game.link}" target="_blank"
                                                class="btn btn-primary pulse-btn-sm  "> बीतक गेम्स खेलें</a>
                                        </div>
                                    </div>
                                    <div class="col-sm-6 ${bitakSaheb[i].qa && bitakSaheb[i].quote.text.trim() !== '' ? '' : 'd-none'}">
                                        <div class="quote-glass">
                                            <div class="quote-text">
                                                <i data-feather="message-circle"
                                                    class="mb-2 "></i><br>
                                                ${bitakSaheb[i].quote.text}
                                            </div>
                                            <div class="quote-author">– ${bitakSaheb[i].quote.author}</div>
                                        </div>
                                    </div>
                                    <div class="col-sm-6 ${bitakSaheb[i].qa && bitakSaheb[i].bitakSandesh.image.trim() !== '' ? '' : 'd-none'}">
                                        <div class="bitakSandesh-card">
                                            <img src="${bitakSaheb[i].bitakSandesh.image}"
                                            alt="Event Image" class="bitakSandesh-image mb-4">
                                            <h2 class="bitakSandesh-title">${bitakSaheb[i].bitakSandesh.text}</h2>
                                        </div>
                                    </div>
                                </div>
                            </div>
                            <div class="col-md-4 ${bitakSaheb[i].qa && bitakSaheb[i].reel.youtube_embed.trim() !== '' ? '' : 'd-none'}">
                                <div class="reel-video">
                                    <iframe
                                        src="https://www.youtube.com/embed/${bitakSaheb[i].reel.youtube_embed}?autoplay=0&mute=1&controls=1&&modestbranding=0&rel=0&loop=1"
                                        title="YouTube Reel"
                                        allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                                        allowfullscreen></iframe>
                                    <h2 class="reel-video-title">${bitakSaheb[i].reel.title}</h2>
                                    <p class="bitak-text text-center">${bitakSaheb[i].reel.subtext}</p>
                                </div>
                            </div>
                            <div class="col-md-4 ${bitakSaheb[i].qa && bitakSaheb[i].reel.facebook_embed.trim() !== '' ? '' : 'd-none'}">
                                <div class="reel-video">
                                    <div class="fb-video" data-href="https://www.facebook.com/reel/${bitakSaheb[i].qa && bitakSaheb[i].reel.facebook_embed}"  data-width="500"  data-show-text="false"></div>    
                                    <h2 class="reel-video-title">${bitakSaheb[i].reel.title}</h2>
                                    <p class="bitak-text text-center">${bitakSaheb[i].reel.subtext}</p>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </li>
            
                `;
    }
}
displaykarkhanaNames("bitakSahebList", bitakSahebList);
