
var bitakSahebList = [
    {
        id: 0,
        date: { day: "14", month: "July", year: "2025" },
        title: "श्री प्राणनाथ जी वाणी ज़ूम (प्रेम मंदिर) में पूज्य स्वामी जी के पधारने पर सभी सुंदरसाथ जी में उत्साह की लहर",
        speaker: "श्री राजन स्वामी जी",
        time: "6:00-7:30 am",
        description: "पुलकित हृदयों से श्री बीतक साहेब 2025 के लिए रखे गए 2 पाठों के समाप्ति पूजन (14 जुलाई) पर श्री प्राणनाथ जी वाणी ज़ूम (प्रेम मंदिर) में पूज्य स्वामी जी के पधारने पर सभी सुंदरसाथ जी में उत्साह की लहर",
        image: "/assets/img/bitaksaheb/14_day_2.jpg",
        link: "https://youtu.be/lyT301B2Nng?si=Zv0TbuaecCgzmz2x",
        bitakSandesh: {
            text: "️पूज्य स्वामी जी के पधारने पर सभी सुंदरसाथ जी में उत्साह की लहर",
            image: "/assets/img/bitaksaheb/14_day_1.jpg",
        },
        quote: {
            text: "ध्यान, वाणी मन्थन और सेवा ही सुन्दरसाथ की आत्मिक सम्पति है।",
            author: "श्री राजन स्वामी जी"
        },
        qa: {
            question: "",
            answer: "",
            link: ""
        },
        game: {
            title: "",
            description: "",
            link: ""
        },
        reel: {
            youtube_embed: "MajSGbv7iic",
            facebook_embed: "",
            title: " स्वामी जी की ओर से सभी प्यारे सुंदरसाथ जी को प्रेम भरा निमंत्रण",
            subtext: "श्री प्राणनाथ ज्ञानपीठ के 19वें वार्षिकोत्सव के लिए स्वामी जी की ओर से सभी प्यारे सुंदरसाथ जी को प्रेम भरा निमंत्रण एवं श्री बीतक साहेब चर्चा के प्रथम प्रयास के लिए पूज्य स्वामी जी का आशीर्वाद व शुभकामनाएँ"
        }
    },
    {
        id: 1,
        date: { day: "15", month: "July", year: "2025" },
        title: "अथ तीन सरूपों की बीतक",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "अथ तीन सरूपों की बीतक — जीव, माया और ब्रह्म का गूढ़ ज्ञान, श्रद्धा और भक्ति से ओतप्रोत पहली दिन की अद्भुत शुरुआत।",
        image: "/assets/img/bitaksaheb/bitaksaheb_day1.png",
        link: "https://youtu.be/P2S20KesJhI?si=3p9J2L4A5WCRe0HB",
        bitakSandesh: {
            text: "️सुनो नहीं, जी लो श्री बीतक साहेब का हर पल",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day1.jpeg",
        },
        quote: {
            text: "ध्यान से भीतर उतरने वाला ही आत्मा की शांति और ब्रह्म का साक्षात्कार कर सकता है।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 1",
            link: "https://forms.gle/QGYee9gWsSMJTdHb7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95007/777/595"
        },
        reel: {
            youtube_embed: "Zv3tysn1Y4U",
            facebook_embed: "",
            title: "#1 बीतक - माया के तूफानों के बीच श्रीजी के लाड ",
            subtext: ""
        }
    },
    {
        id: 2,
        date: { day: "16", month: "July", year: "2025" },
        title: "आखिर क्यों रचा गया ब्रज और रास का खेल?",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "🌹 Day 2 || सोनिया जी (ऑस्ट्रेलिया) द्वारा श्री बीतक चर्चा 2025 || Live Streaming- 16 July 🌹",
        image: "/assets/img/bitaksaheb/bitaksaheb_day2.png",
        link: "https://www.youtube.com/live/8RYneqG7DzU?si=rmCbftf0svEZTvfP",
        bitakSandesh: {
            text: "️💎 श्री बीतक संदेश - 2, सुनो नहीं, जी लो — बीतक साहेब का हर पल 💎",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day2.jpeg",
        },
        quote: {
            text: "आपण ने तेडवा आविया, आ दुस्तर माया मांहें। <br> ओलखी ने कां ओसरे, भूंडा एम थयो तू कांए।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 2",
            link: "https://forms.gle/1MkmAZTecGGZbSES7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/94897/664/664"
        },
        reel: {
            youtube_embed: "MeWPaxUsP9Q",
            facebook_embed: "",
            title: "#2 बीतक - महारास की रामतों में जागनी रास के संकेत",
            subtext: ""
        }
    },
    {
        id: 3,
        date: { day: "17", month: "July", year: "2025" },
        title: "प्रियतम की खोज में तप और त्याग की मूरत – श्री देवचन्द्र जी",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "प्रियतम की खोज में तप और त्याग की मूरत",
        image: "/assets/img/bitaksaheb/bitaksaheb_day3.png",
        link: "https://youtu.be/34fkae_prYU?si=_28hDaNEGnRidxUJ",
        bitakSandesh: {
            text: "️💎 श्री बीतक संदेश - 3, बीतक में उतरें तो समझेंगे — धनी कितने पास हैं।",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day3.jpeg",
        },
        quote: {
            text: "जब जनमे मारवाड़ में, घर अति आनन्द नरनार। <br> यह बधाई ब्रह्मांड में, त्रिगुण समेत विस्तार।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 3",
            link: "https://forms.gle/WBJgdJFbhZPRn9Wu6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/94917/667/619"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F1233624818089135",
            title: "#3 बीतक - माया रूपी गठरी सौंप कर तो देखिए साथ जी",
            subtext: ""
        }
    },
    {
        id: 4,
        date: { day: "18", month: "July", year: "2025" },
        title: "'सखी भाव से भजियो भरतार' - हरिदास जी की प्रेममयी सिखापन।",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "'सखी भाव से भजियो भरतार' - हरिदास जी की प्रेममयी सिखापन।",
        image: "/assets/img/bitaksaheb/bitaksaheb_day4.png",
        link: "https://youtu.be/6FEAlVEKlTo?si=EOQDKjoG8a8kUhxM",
        bitakSandesh: {
            text: "️💎 श्री बीतक संदेश - 4: सुनो नहीं, जी लो — बीतक साहेब का हर पल। 💎",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day4.jpeg",
        },
        quote: {
            text: "जब जनमे मारवाड़ में, घर अति आनन्द नरनार। <br> यह बधाई ब्रह्मांड में, त्रिगुण समेत विस्तार।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 4",
            link: "https://forms.gle/uJueEQaEau8Be1T58"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/94960/078/808"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F1353370802428046",
            title: "#4 बीतक - हुकम के खेल में रहनी का श्रृंगार",
            subtext: ""
        }
    },
    {
        id: 5,
        date: { day: "19", month: "July", year: "2025" },
        title: "श्री देवचंद्र जी को धाम धनी के साक्षात दर्शन",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "'Day 5 - श्री बीतक साहेब - सोनिया सखी (ऑस्ट्रेलिया) - श्री देवचंद्र जी को धाम धनी के साक्षात दर्शन",
        image: "/assets/img/bitaksaheb/bitaksaheb_day5.png",
        link: "https://youtu.be/cF5Jh1lOslU?si=ZcN9gGArbDFTnFol",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 5: When Bītak flows, maya fades. Only Piya remains.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day5.jpeg",
        },
        quote: {
            text: "वय किसोर अति सुन्दर, सरूप खेला जो वृन्दावन। देख श्री देवचन्द्र जी ने कह्या, जैसी गवाही दई मन।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 5",
            link: "https://forms.gle/tqePda9EfoeY1kLm9"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/94982/979/711"
        },
        reel: {
            youtube_embed: "XN5LDz036OY",
            facebook_embed: "",
            title: "#5 बीतक - आत्मिक आहार की वैरायटी",
            subtext: ""
        }
    },
    {
        id: 6,
        date: { day: "20", month: "July", year: "2025" },
        title: "श्री मिहिरराज जी व सतगुरु देवचन्द्र जी का मिलन",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "🌸 Day 6 - श्री बीतक साहेब - सोनिया सखी (ऑस्ट्रेलिया) - मिहिरराज जी व सतगुरु देवचन्द्र जी का मिलन 🌸",
        image: "/assets/img/bitaksaheb/bitaksaheb_day6.png",
        link: "https://youtu.be/4Q-LE9mTAjI?si=G2-bLSOf4g2kLRUV",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 6: Feel the words, meet yourself.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day6.jpeg",
        },
        quote: {
            text: "मिलाप श्री देवचन्द्रजी का, सोहबत श्रीजी साहिब। <br> सम्वत सोलह सै सतासियमें, सो सत्रह सौ बारोत्तरलों अब।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 6",
            link: "https://forms.gle/aEasDBdNq9wDaJPDA"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95006/883/983"
        },
        reel: {
            youtube_embed: "_QTGlgqWVXM",
            facebook_embed: "",
            title: "#6 बीतक - विकारों को मायके भेज दीजिए ",
            subtext: ""
        }
    },
    {
        id: 7,
        date: { day: "21", month: "July", year: "2025" },
        title: "श्री सतगुरु और मिहिरराज जी में 9 वर्ष का कठिन वियोग",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "🌸 Day 7 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - सतगुरु और मिहिरराज जी में 9 वर्ष का कठिन वियोग",
        image: "/assets/img/bitaksaheb/bitaksaheb_day7.png",
        link: "https://youtu.be/dQZVntTml-w?si=NTyhSz5iFZ4kYhk-",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 7: बीतक में उतरें तो समझेंगे — धनी कितने पास हैं।",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day7.jpeg",
        },
        quote: {
            text: "तब बिहारीजी को कह्या, तुम बुलाये ल्याओ इन। <br> मैं धाम दरवाजे पैठ ना सकों, ठाढ़ी इन्द्रावती करे रुदन।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 7",
            link: "https://forms.gle/ZqKquYthM6EkPzug9"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/resource/95048614"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F2024550624954923",
            title: "#7 बीतक - ‘दिल’ से माया को हटाओ, ‘पिया’ को बसाओ",
            subtext: ""
        }
    },
    {
        id: 8,
        date: { day: "22", month: "July", year: "2025" },
        title: " हब्से में मार्मिक विरह और तारतम वाणी अवतरण",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 8 - श्री बीतक साहेब - सोनिया सखी (ऑस्ट्रेलिया) - हब्से में मार्मिक विरह और तारतम वाणी अवतरण",
        image: "/assets/img/bitaksaheb/bitaksaheb_day8.png",
        link: "https://youtu.be/b2lrZhaw-UY?si=rgS5q8LM6RBEvwUG",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 8: Every word whispers: I'm with you. 💞 – श्रीजी",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day8.jpeg",
        },
        quote: {
            text: "मिलाप श्री देवचन्द्रजी का, सोहबत श्रीजी साहिब। <br> सम्वत सोलह सै सतासियमें, सो सत्रह सौ बारोत्तरलों अब।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 8",
            link: "https://forms.gle/7S2rPHXf7yPHjoPR9"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95085/549/838"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F2201409173632457",
            title: "#8 बीतक - नैनन की करि कोठरी में प्रेम ही प्रेम",
            subtext: ""
        }
    },
    {
        id: 9,
        date: { day: "23", month: "July", year: "2025" },
        title: "श्री जी की हरजी व्यास से भेंट और वार्ता",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 9 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्री जी की हरजी व्यास से भेंट और वार्ता",
        image: "/assets/img/bitaksaheb/bitaksaheb_day9.png",
        link: "https://youtu.be/0B9y3HTd8VY?si=6iR-hHS6a48Ml8cH",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 9 Read slowly… it's not text, it's truth.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day9.jpeg",
        },
        quote: {
            text: "तब श्री जी ए कह्या, ए तो कह्या मिने इण्ड। <br> ए महाप्रलय में ना रहे, उड़े त्रिगुन समेत ब्रह्माण्ड।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 9",
            link: "https://forms.gle/JNDuXLfYC619EoZ7A"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/resource/95151370"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F2134820150372021",
            title: "#9 बीतक - झुकने में जो ऊँचाई है, वो बीतक में दिखलाई है",
            subtext: ""
        }
    },
    {
        id: 10,
        date: { day: "24", month: "July", year: "2025" },
        title: "ईमान की कसौटी पर खरे उतरे जयराम भाई कंसारा",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 10 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - ईमान की कसौटी पर खरे उतरे जयराम भाई कंसारा",
        image: "/assets/img/bitaksaheb/bitaksaheb_day10.png",
        link: "https://youtu.be/TTh8N-h6VZw?si=bAkf4w-HM3LqT6jp",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 10 This is not content. It’s contact with the divine.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day10.jpeg",
        },
        quote: {
            text: "एक जयराम खड़ा रह्या, और इनके घर के लोक। <br> इनों आपोपा दिया, रहे अपने जोक।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 10",
            link: "https://forms.gle/jeGvmh8DPNmXpMDy5"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95171/689/838"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F1400972371122437",
            title: "#10 बीतक - द ब्रह्मांगना ब्रैंड - The Bramhangana Brand",
            subtext: ""
        }
    },
    {
        id: 11,
        date: { day: "25", month: "July", year: "2025" },
        title: "श्रीजी द्वारा ठट्ठानगर में जागनी",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 11 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्रीजी द्वारा ठट्ठानगर में जागनी",
        image: "/assets/img/bitaksaheb/bitaksaheb_day11.png",
        link: "https://youtu.be/pHGSqRJyfiU?si=T_Gm3GGajQeyg0P6",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 11 Not a story. A soul’s memory – echoed by Piya. ",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day11.jpeg",
        },
        quote: {
            text: "तब श्रीजीयें सराहिया, स्याबास चिन्तामन। <br> पाई तें निसबत, ए सुकन मोमिन।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 11",
            link: "https://forms.gle/ZuMMAypEaqvCv8Ti8"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95209/975/819"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F2265430630578769",
            title: "#11 बीतक - Beetak is a MIRROR for HEART",
            subtext: ""
        }
    },
    {
        id: 12,
        date: { day: "26", month: "July", year: "2025" },
        title: "श्रीजी की आज्ञा मान कर भैरव सेठ ने तीन दिन में वस्त को किया प्राप्त",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 12 - श्री बीतक साहेब - श्रीजी की आज्ञा मान कर भैरव सेठ ने तीन दिन में वस्त को किया प्राप्त",
        image: "/assets/img/bitaksaheb/bitaksaheb_day12.png",
        link: "https://youtu.be/-dRh4o-2Ly0?si=muycVNp8KFvs7VuB",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 12 Every line = One step closer to Him.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day12.jpeg",
        },
        quote: {
            text: "पीउना तमाखूं छोड़ देओ, और मांस मछली सब। <br> सराब और सब कैफ, परदारा चोरी न कब।।<br> <br> मैं जनम भर को छोड़िया, ए चारों वस्त निखेद। <br> वस्त भई मोहे प्रापत, पाया माया माहें भेद।। <br> ",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 12",
            link: "https://forms.gle/xLk1UjCRZbmAchbb6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/resource/95241481"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F1806151253645136",
            title: "#12 बीतक - मिश्री की ईंटों से बनता प्रेम का मकान",
            subtext: ""
        }
    },
    {
        id: 13,
        date: { day: "27", month: "July", year: "2025" },
        title: "श्रीजी की करुणा और बिहारीजी की मर्यादा में टकराव, धाराभाई का निष्कासन",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 13 - श्री बीतक साहेब - श्रीजी की करुणा और बिहारीजी की मर्यादा में टकराव, धाराभाई का निष्कासन",
        image: "/assets/img/bitaksaheb/bitaksaheb_day13.png",
        link: "https://youtu.be/QlTpOxOd23E?si=3a-nQtWzR6zmKo6d",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 13 Dive deeper. Truth isn't on the surface.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day13.jpeg",
        },
        quote: {
            text: "बहुत खीझ के कह्या, इनें करों न दाखिल साथ। <br> इनका दुख मोहे बहुत है, याके कबहुं न पकड़ो हाथ।।<br> <br> तब श्री जी साहिब जी नें, दिन दोय चार बीच डार। <br> फेर अरज विनती करी, तुम इनका करो विचार।। <br> ",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 13",
            link: "https://forms.gle/s6j5jTfWqh5bqPqi7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95255/642/796"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F4610386935854218",
            title: "#13 बीतक - पाँचवें दिन के सुंदरसाथ - 30 दिनों का लक्ष्य 3 दिन में प्राप्त, छठे दिन के सुंदरसाथ - आपस के विवादों में ऊर्जा समाप्त",
            subtext: ""
        }
    },
    {
        id: 14,
        date: { day: "28", month: "July", year: "2025" },
        title: "श्री जी और बिहारी जी के सिद्धांतों में अंतर",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 14 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्री जी और बिहारी जी के सिद्धांतों में अंतर",
        image: "/assets/img/bitaksaheb/bitaksaheb_day14.png",
        link: "https://youtu.be/ME4nqRzEvYA?si=AD9yZq7100cFlOeK",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 14 You don't just read Bitak. You return to yourself.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day14.jpeg",
        },
        quote: {
            text: "तब श्री जी साहिब जी नें, दिन दोय चार बीच डार। <br> फेर अरज विनती करी, तुम इनका करो विचार।। ",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 14",
            link: "https://forms.gle/RCwwbeDR3TqN19sa6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95292/216/337"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F732199306268115",
            title: "#14 बीतक - बीतक - आकर्षण पानी का बुलबुला न हो",
            subtext: ""
        }
    },
    {
        id: 15,
        date: { day: "29", month: "July", year: "2025" },
        title: "श्री जी और बिहारी जी के मार्ग हुए विमुख",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 15 - श्री बीतक साहेब - सोनिया जी (ऑस्ट्रेलिया) - श्री जी और बिहारी जी के मार्ग हुए विमुख",
        image: "/assets/img/bitaksaheb/bitaksaheb_day15.png",
        link: "https://youtu.be/kyxhAIOSem8?si=agamf5FPgpXlQwUi",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 15 Truth isn’t taught. It’s felt through Bitak.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day15.jpeg",
        },
        quote: {
            text: "तब श्री जी साहिब जी नें, दिन दोय चार बीच डार। <br> फेर अरज विनती करी, तुम इनका करो विचार।। ",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 15",
            link: "https://forms.gle/BPQ8yR4EVxpvBe9w6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/resource/95336574"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "2F2516556442052342",
            title: "#15 बीतक - बीतक - ये सेवा नहीं आसां...",
            subtext: ""
        }
    },
    {
        id: 16,
        date: { day: "30", month: "July", year: "2025" },
        title: "सिद्धपुर में पहला ज्ञानकेंद्र, मेड़ता में राजा राम + झांझन भाई की सेवा",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 16 - श्री बीतक साहेब - सिद्धपुर में पहले ज्ञानकेंद्र की स्थापना, मेड़ता में राजा राम जी एवं झांझन भाई जी की अविस्मरणीय सेवा प्रारंभ।",
        image: "/assets/img/bitaksaheb/bitaksaheb_day16.png",
        link: "https://youtu.be/-ebFQ73yPNk?si=CsuQZ_Dgns8h8r-n",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 16 One verse. Infinite peace. 🌿 That’s the power of Bitak.",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day16.jpeg",
        },
        quote: {
            text: "थाना थाप्या सिद्धपुर में, केसव भट्ट के घर। <br> धाम चरचा नित होवहीं, साथ रह्या पकर।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 16",
            link: "https://forms.gle/Pe7jvGkdrTdE6ZQu7"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95381/732/799"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "",
            title: "",
            subtext: ""
        }
    },
    {
        id: 17,
        date: { day: "31", month: "July", year: "2025" },
        title: "श्रीजी का दिल्ली आगमन, गरीबदास जी का धामधनी से मिलन, कूच किया हरिद्वार की ओर।",
        speaker: "सोनिया सखी (ऑस्ट्रेलिया)",
        time: "6:00-7:30 am",
        description: "Day 16 - श्री बीतक साहेब - श्रीजी का दिल्ली आगमन, गरीबदास जी का धामधनी से मिलन, कूच किया हरिद्वार की ओर।",
        image: "/assets/img/bitaksaheb/bitaksaheb_day17.png",
        link: "",
        bitakSandesh: {
            text: "️श्री बीतक संदेश - 17 This is not content. It’s contact with the divine",
            image: "/assets/img/bitaksaheb/quotes/quote_message_day17.jpeg",
        },
        quote: {
            text: "इन पाती लिखने में रहें, श्री जी और लालदास। <br> रात दिन मेहनत करी, श्री राज सेवन की आस।।",
            author: "श्री प्राणनाथ जी"
        },
        qa: {
            question: "श्री बीतक क्विज़",
            answer: "SPJV श्री बीतक साहेब <br> Quiz Day 17",
            link: "https://forms.gle/A9unNG8BN6bFBDEx6"
        },
        game: {
            title: "ज्ञानवर्धक गेम्स",
            description: "अपना ज्ञान परखें इस मजेदार खेल के साथ!",
            link: "https://wordwall.net/play/95422/431/977"
        },
        reel: {
            youtube_embed: "",
            facebook_embed: "",
            title: "",
            subtext: ""
        }
    }
]


function displaykarkhanaNames(divid, bitakSaheb) {
    const studentsList = document.getElementById(divid);

    for (let i = 0; i < bitakSaheb.length; i++) {
        studentsList.innerHTML =
            studentsList.innerHTML +
            `
            <li class="timeline-item">
                <div class="timeline-info">
                    <div class="date-box">
                        <div class="date-day">${bitakSaheb[i].date.day}</div>
                        <div class="date-month-year">
                            <span class="date-month">${bitakSaheb[i].date.month}</span>
                            <span class="date-year">${bitakSaheb[i].date.year}</span>
                        </div>
                    </div>
                </div>
                <div class="timeline-marker"></div>
                <div class="timeline-content">
                    <div class="container">
                        <div class="row bitak-card">
                            <div class="col-md-8">
                                <img src="${bitakSaheb[i].image}"
                                    alt="Event Image" class="bitak-card-image mb-4">
                                <div class="row">
                                    <div class="col-md-9">
                                        <a target="_blank" href="${bitakSaheb[i].link}" class="bitak-title"> ${bitakSaheb[i].title}
                                        </a>
                                        <h6 class="bitak-meta d-md-block"><i data-feather="user"
                                                class="mb-2"></i>${bitakSaheb[i].speaker} |

                                            <div class="event-date d-inline-block">
                                                <i data-feather="clock"></i>
                                            ${bitakSaheb[i].time}
                                            </div>
                                        </h6>
                                    </div>
                                    <div class="col-md-3">
                                        <a href="${bitakSaheb[i].link}" target="_blank"
                                                        class="btn btn-primary bitak-btn pulse-button" > लाइव देखें</a>
                                    </div>
                                </div>
                                <p class="bitak-text">
                                    ${bitakSaheb[i].description}
                                </p>
                                <div class="row">
                                    <div class="col-sm-6 ${bitakSaheb[i].qa && bitakSaheb[i].qa.link.trim() !== '' ? '' : 'd-none'}">
                                        <div class="qa-box">
                                            <i data-feather="help-circle" class="mb-2 "></i><br>
                                            <div class="question">${bitakSaheb[i].qa.question}  </div>
                                            <div class="answer">${bitakSaheb[i].qa.answer}</div>
                                            <a target="_blank" class="btn btn-primary pulse-btn-sm " href="${bitakSaheb[i].qa.link}">बीतक क्विज़</a> 
                                        </div>
                                    </div>
                                    <div class="col-sm-6 ${bitakSaheb[i].qa && bitakSaheb[i].game.link.trim() !== '' ? '' : 'd-none'}">
                                        <div class="game-card">
                                            <i data-feather="github" class="mb-2 "></i><br>
                                            <div class="game-title">${bitakSaheb[i].game.title}</div>
                                            <div class="game-desc">${bitakSaheb[i].game.description}</div>
                                            <a href="${bitakSaheb[i].game.link}" target="_blank"
                                                class="btn btn-primary pulse-btn-sm  "> बीतक गेम्स खेलें</a>
                                        </div>
                                    </div>
                                    <div class="col-sm-6 ${bitakSaheb[i].qa && bitakSaheb[i].quote.text.trim() !== '' ? '' : 'd-none'}">
                                        <div class="quote-glass">
                                            <div class="quote-text">
                                                <i data-feather="message-circle"
                                                    class="mb-2 "></i><br>
                                                ${bitakSaheb[i].quote.text}
                                            </div>
                                            <div class="quote-author">– ${bitakSaheb[i].quote.author}</div>
                                        </div>
                                    </div>
                                    <div class="col-sm-6 ${bitakSaheb[i].qa && bitakSaheb[i].bitakSandesh.image.trim() !== '' ? '' : 'd-none'}">
                                        <div class="bitakSandesh-card">
                                            <img src="${bitakSaheb[i].bitakSandesh.image}"
                                            alt="Event Image" class="bitakSandesh-image mb-4">
                                            <h2 class="bitakSandesh-title">${bitakSaheb[i].bitakSandesh.text}</h2>
                                        </div>
                                    </div>
                                </div>
                            </div>
                            <div class="col-md-4 ${bitakSaheb[i].qa && bitakSaheb[i].reel.youtube_embed.trim() !== '' ? '' : 'd-none'}">
                                <div class="reel-video">
                                    <iframe
                                        src="https://www.youtube.com/embed/${bitakSaheb[i].reel.youtube_embed}?autoplay=0&mute=1&controls=1&&modestbranding=0&rel=0&loop=1"
                                        title="YouTube Reel"
                                        allow="accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture"
                                        allowfullscreen></iframe>
                                    <h2 class="reel-video-title">${bitakSaheb[i].reel.title}</h2>
                                    <p class="bitak-text text-center">${bitakSaheb[i].reel.subtext}</p>
                                </div>
                            </div>
                            <div class="col-md-4 ${bitakSaheb[i].qa && bitakSaheb[i].reel.facebook_embed.trim() !== '' ? '' : 'd-none'}">
                                <div class="reel-video">
                                <iframe src="https://www.facebook.com/plugins/video.php?height=580&href=https%3A%2F%2Fwww.facebook.com%2Freel%${bitakSaheb[i].qa && bitakSaheb[i].reel.facebook_embed}%2F&show_text=false&width=300&t=0"  height="640" style="border:none;overflow:hidden" scrolling="no" frameborder="0" allowfullscreen="true" allow="autoplay; clipboard-write; encrypted-media; picture-in-picture; web-share" allowFullScreen="true"></iframe>
                                   
                                    <h2 class="reel-video-title">${bitakSaheb[i].reel.title}</h2>
                                    <p class="bitak-text text-center">${bitakSaheb[i].reel.subtext}</p>
                                </div>
                            </div>
                        </div>
                    </div>
                </div>
            </li>
            
                `;
    }
}
displaykarkhanaNames("bitakSahebList", bitakSahebList);
